package homework_11;

import java.util.Arrays;

public class HomeWork11_1 {
public static void main(String[] args) {
// Задание 1
//Написать метод, принимающий на целое входное число. Метод должен вывести на экран 2 степени этогоЧисло
//класс Math для нахождения степени использования нельзя ;)
    int j=2;
    printValue(j);
}
public static void printValue(int j){
  for (int i=1;i>=0;i++){
      j*=2;
  }
    System.out.println(j);
}
        }



