package homework_14;

public class HW14_3 {
    public static void main(String[] args) {
       // Задача 2
       // Написать метод, принимающий строку и один или два индекса (перегрузка).
        // Метод должен возвращать строение с первым индексом (включительно) и заканчивая строением индекса (неограниченно).
        //Функционал повторяет метод String.substring(), так что этот метод не нужен.
        // Оригинальный метод ломает программу, если введены не корректные индексы.
        // Наш метод аварийно завершить программу не должен.
        
    }

}
