package homework_08;

public class HomeWork08_1 {
    public static void main(String[] args) {
// Задача 0.
        // Распечатать 10 строк: «Задача1». «Задание2». … «Задание10». Используем цикл while

        int str=1;

        while (str <= 10) {
            System.out.println( " <<Задача "+str+">>.");
            str++;
        }

    }
}
